app/views/comments/_comment.html.erb

    <% end %>
    <li class="action"><%=comment.comment_scores.count%> &#x2764;'s</li>
---
SELECT COUNT(*) FROM "comment_scores"  WHERE "comment_scores"."comment_id" = ?  [["comment_id", 3]]