app/views/topics/index.html.erb

SELECT COUNT(*) FROM "scores"  WHERE "scores"."topic_id" = ?  [["topic_id", 8]]
---
   				 	<%=link_to image_tag("http://icons.iconarchive.com/icons/rokey/the-blacy/128/black-heart-icon.png", width: 30), {controller: "scores", action: "create", topic_id: topic.id, score: {topic_id: topic.id, user_id: @user.id}}, method: 'post'%> </br>
   				 	 <%=topic.scores.count%> &#x2764;'s