app/views/users/show.html.erb


  <% @user.topics.each do |topic| %>
---
SELECT "topics".* FROM "topics"  WHERE "topics"."user_id" = ?  ORDER BY created_at DESC  [["user_id", 11]]


  <% @user.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."user_id" = ?  [["user_id", 11]]