app/views/tagations/_form.html.erb

SELECT "tags".* FROM "tags"
---
    <%=  %>
    <%= collection_select :tagation, :tag_id, Tag.all, :id, :subject %>