Preventive-Measures/app/controllers/comments_controller.rb

  def create
    @topic = Topic.find(params[:topic_id])
    @comment = @topic.comments.create(comment_params)
---
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("body", "created_at", "topic_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "jiuwdjowqdwq"], ["created_at", "2014-08-29 04:14:51.306656"], ["topic_id", 2], ["updated_at", "2014-08-29 04:14:51.306656"]]