Preventive-Measures/app/controllers/tags_controller.rb

  def edit
    @tag = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @tag = Tag.new(tag_params)

    if @tag.save
---
INSERT INTO "tags" ("created_at", "subject", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-08-29 16:52:20.597237"], ["subject", "This Is A Subject!"], ["updated_at", "2014-08-29 16:52:20.597237"]]