Preventive-Measures/app/controllers/topics_controller.rb

	def create
		@topic = Topic.new
		if @topic.save
---
INSERT INTO "topics" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "world"], ["created_at", "2014-08-29 00:51:39.923470"], ["title", "hello"], ["updated_at", "2014-08-29 00:51:39.923470"]]

	def destroy
		@topic = Topic.find(params[:id])
		@topic.destroy
---
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]