app/controllers/comments_controller.rb

SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "comments" SET "updated_at" = ?, "user_id" = ? WHERE "comments"."id" = 1  [["updated_at", "2014-09-01 02:35:48.547457"], ["user_id", 2]]
---
  def create
    @topic = Topic.find(params[:topic_id])
    @comment = @topic.comments.create(comment_params)
    @comment.user_id = User.find(session[:user_id]).id
    @comment.save