app/controllers/comment_scores_controller.rb

  def create
    @user = User.find(session[:user_id])
    votes = @user.comment_scores.map {|score| score.comment.id }
    comment = comment_score_params[:comment_id]
    unless votes.include?(comment.to_i)
      @comment_score = @user.comment_scores.create(comment_score_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
SELECT "comment_scores".* FROM "comment_scores"  WHERE "comment_scores"."user_id" = ?  [["user_id", 1]]
INSERT INTO "comment_scores" ("comment_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["comment_id", 1], ["created_at", "2014-09-01 02:36:26.100231"], ["updated_at", "2014-09-01 02:36:26.100231"], ["user_id", 1]]