app/controllers/scores_controller.rb

  def create
    @user = User.find(session[:user_id])
    votes = @user.scores.map {|score| score.topic.id }
    topic = score_params[:topic_id]
    unless votes.include?(topic.to_i)
      @score = @user.scores.create(score_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 11]]
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 12]]
SELECT "scores".* FROM "scores"  WHERE "scores"."user_id" = ?  [["user_id", 11]]
INSERT INTO "scores" ("created_at", "topic_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-01 02:22:00.648523"], ["topic_id", 12], ["updated_at", "2014-09-01 02:22:00.648523"], ["user_id", 11]]