app/controllers/tagations_controller.rb

INSERT INTO "tagations" ("created_at", "tag_id", "tagable_id", "tagable_type", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-09-01 11:54:04.877345"], ["tag_id", 8], ["tagable_id", 3], ["tagable_type", "Topic"], ["updated_at", "2014-09-01 11:54:04.877345"], ["user_id", 4]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 3]]
---
  def create

    Tagation.create(tagation_params)
    p params
    p "**************************************"
    tagation = Tagation.new(tagation_params)
    tagation.user_id = User.find(session[:user_id]).id
    tagation.save
    @topic = Topic.find(tagation.tagable_id) if tagation.tagable_type == "Topic"