app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @tag = Tag.find(params[:id])

INSERT INTO "tags" ("created_at", "subject", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-09-01 02:35:56.063658"], ["subject", "headache"], ["updated_at", "2014-09-01 02:35:56.063658"]]
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "tagations" ("created_at", "tag_id", "tagable_id", "tagable_type", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-09-01 02:35:56.068295"], ["tag_id", 1], ["tagable_id", 1], ["tagable_type", "Topic"], ["updated_at", "2014-09-01 02:35:56.068295"], ["user_id", 2]]
---
  def create
    @tag = Tag.find_or_create_by(tag_params)

    if params[:topic_id]
      tagable = Topic.find(params[:topic_id])
      @topic = tagable
      tagable_type = "Topic"
    else
      tagable = Comment.find(params[:comment_id])
      @topic = Topic.find(tagable.topic.id)
      tagable_type = "Comment"
    end

    user = User.find(session[:user_id])

    Tagation.create(tagable_id: tagable.id, tagable_type: tagable_type, user_id: user.id, tag_id: @tag.id)