app/controllers/topics_controller.rb

  def index
    # @topics = Topic.order(created_at: :desc)
    @topics = Topic.search(params[:search])
    @topic = Topic.new
    @user = User.find(session[:user_id]) if session[:user_id]
---
SELECT "topics".* FROM "topics"  WHERE (title LIKE '%efef%' OR body LIKE '%efef%')  ORDER BY created_at DESC
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 12]]

  def show
    if session[:user_id]
      @topic = Topic.find(params[:id])
      @user = User.find(session[:user_id])
    else
      @topics = Topic.order(created_at: :desc)
---
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 10]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "topics".* FROM "topics"   ORDER BY created_at DESC, "topics"."created_at" DESC

  def create
    if session[:user_id]
      @topic = Topic.new(topic_params)
      @topic.user_id = User.find(session[:user_id]).id
      if @topic.save
          redirect_to @topic
        else
          flash.now[:notice] = "You need to be logged in!"
          redirect_to root_path
      end
    else
      @topics = Topic.all
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 11]]
INSERT INTO "topics" ("body", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "wefwe"], ["created_at", "2014-09-01 02:16:46.737230"], ["title", "efef"], ["updated_at", "2014-09-01 02:16:46.737230"], ["user_id", 11]]
SELECT "topics".* FROM "topics"   ORDER BY created_at DESC

  def edit
    @topic = Topic.find(params[:id])
---
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 2]]

  def update
    @topic=Topic.find(params[:id])
    if @topic.update(topic_params)
---
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 2]]
UPDATE "topics" SET "body" = ?, "updated_at" = ? WHERE "topics"."id" = 2  [["body", "I am very tired. What should I do?"], ["updated_at", "2014-09-01 11:06:25.377955"]]

  def destroy
    @topic = Topic.find(params[:id])
    @topic.destroy
---
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]