app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" IS NULL LIMIT 1
SELECT "comments".* FROM "comments"  WHERE "comments"."user_id" = ?  [["user_id", 11]]
---
  def show
      @user = User.find_by_id(session[:user_id])
      @comments = Comment.where(:user_id == session[:user_id])